import numpy as np

vp_word_in = {'본인':18.7, '통장' : 17.7, '말씀':16.2, '사건':14.9, '계좌':14.6, '부분':14.6,'확인':12.1, '조사':11.5,
'떄문' : 11.1, '피해자':11.1, '사용':10.3, '개설':9.8, '명의':9.8, '처리':8.4, '연락':7.8,'수사':7.0, '농협':6.9, '불법':6.2,
'녹취':6.1, '은행':5.9, '진술':5.8, '검거':5.7, '피해': 5.5, '전화':5.4, '경우':5.2, '개인정보': 5.1, '내용': 5.1, '금융':4.9,
'거래':4.9, '발견': 4.8, '유출':4.8, '자금':4.8, '금융권':4.6, '범죄':4.6, '도용':4.5, '사람':4.4, '정보':4.4,
'선생님' : 4.3, '대포통장': 4.3, '수사관': 4.0, '압수':4.0, '동결':3.8, '가능':3.8, '이해':3.7, '입증':3.6, '금융감독원': 3.6,
'사실' : 3.5, '현장' : 3.4, '가지' : 3.4, '경찰청':7.1,}

vp_word_lo = {'고객님':18.4, '대출' : 13.1, '진행':7.6,'상환':7.0,
 '때문':5.6, '정도':3.2, '전산':3.0,'납부':6, '금액':5.6, '금리':2.8,
'심사':2.6, '신용':2.4, '담당자':2.4, '서류':2.2, '접수':2.2, '상품': 2.2, '이용': 2.2, '시간':2.2,
'승인':2.2, '한도':2.2, '방법':2.0, '잠시':2.0, '발급':1.8, '필요':1.8,
'통화' : 1.8, '신청': 1.8, '다음': 1.8, '안내':1.6, '대환':1.6, '이야기':1.4, '개월':1.4, '요청':1.4,
'카드' : 1.4, '비용' : 1.4, '대출금' : 1.4, '상황': 1.4, '이자' : 1.4
}
# '처리':4.1, '계좌': 1.1, '말씀':3.8, '자금':3.5, '부분':3.7, '전화' : 3.1, '확인':2.8, '가능':2.2, '연락':1.5, '은행':1.3, '경우': 1.1, '농협': 0.7,
# 고객님':20.4, '대출' : 15.1

부사 = {'혹시':[0, 17.3], '현재':[0, 14.8]}

sum_exp_in = np.sum([np.exp(v) for v in vp_word_in.values()])
def softmax_in(x) :
    exp_x = np.exp(x)
    y = exp_x / sum_exp_in
    return y

sum_exp_lo = np.sum([np.exp(v) for v in vp_word_lo.values()])
def softmax_lo(x) :
    exp_x = np.exp(x)
    y = exp_x / sum_exp_lo
    return y

def softmax_부사(x) :
    exp_x = np.exp(x)
    y = exp_x / sum_exp_lo
    return y